АТДЛК/src/Documents/ЗаявкаНаПеревозку/ЗаявкаНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПеревозку</name>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ПеречислениеСтатусЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПогрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаРазгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Транспорт</types>
    </type>
  </attributes>
</mdclass:Document>

АТДЛК/src/Documents/ЗаявкаНаПеревозку/Forms/ФормаДокументаМаршрута/Module.bsl
&НаСервере 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Объект.ДатаПогрузки = Параметры.ДатаПогрузки;
	Объект.ДатаРазгрузки = Параметры.ДатаРазгрузки;
	Объект.ТочкаРазгрузки = Параметры.НачальнаяТочка;
	Объект.ТочкаПогрузки = Параметры.КонечнаяТочка;
КонецПроцедуры



&НаКлиенте
Процедура МояКнопка(Команда)
	
	//Перевозчик, Стоимость, Статус,Ид
	СтруктураЗаявкаНаПеревозку = Новый Структура("");
	СтруктураЗаявкаНаПеревозку.Вставить("Перевозчик", Объект.Перевозчик);
	СтруктураЗаявкаНаПеревозку.Вставить("Сумма", Объект.Сумма);
	СтруктураЗаявкаНаПеревозку.Вставить("Статус", Объект.Статус);
	СтруктураЗаявкаНаПеревозку.Вставить("ЗаявкаНаПеревозку", Объект.Ссылка);
	Закрыть(СтруктураЗаявкаНаПеревозку);
КонецПроцедуры
